IdeaRS.OpenModel.Connection.ReportSettings
Report settings for IDEA connections.

IdeaRS.OpenModel.Connection.ReportSettings.ReportType
Gets or sets the type of report.

IdeaRS.OpenModel.Connection.ReportSettings.Views
Indicates, whether generate views (XY, XZ, YZ) into report.

IdeaRS.OpenModel.Connection.ReportSettings.ResultsPictures
Indicates, whether generate pictures of results.

IdeaRS.OpenModel.Connection.ReportSettings.SymbolExplanations
Indicates, whether generate explanations to report.

IdeaRS.OpenModel.Connection.ReportSettings.PlatesDrawings
Indicates, whether generate drawing of plates.

IdeaRS.OpenModel.Connection.ReportSettings.TheoreticalBackground
Indicates, whether generate theoretical background.

IdeaRS.OpenModel.Connection.ReportSettings.CultureName
The name of the required culture of the report